[{"id": "c268ba665ec6daf823151d261a8e1c29", "text": "There are only four words in the English language which end in \"dous\": tremendous, horrendous, stupendous, and  hazardous."}, {"id": "38c20d44406abf1163c0d7d7e5028811", "text": "There are 1,575 steps from the ground floor to the top of the Empire State building."}, {"id": "6efa598440e7dd50ed626237abb100c2", "text": "A signature is called a John Hancock because he signed the Declaration of Independence. Only 2 people signed the declaration of independence on July 4. The Last person signed 2 years later."}, {"id": "6d91707d7ccb2c64ab8067013bd770cd", "text": "A shark is the only fish that can blink with both eyes."}, {"id": "aabe6525be651bc9790f6943765de9c6", "text": "Shakespeare invented the word `assassination` and `bump`."}, {"id": "9f64314718d2564d619901009f03d38a", "text": "In the last 4000 years, no new animals have been domesticated."}, {"id": "3d292e6a5b57a1e71ac3e8cb5aa18f16", "text": "Count the number of cricket chirps in a 15-second period, add 37 to the total, and your result will be very close to the actual outdoor Fahrenheit temperature."}, {"id": "cf5c120b33a1c96d981bd8b21339ffa4", "text": "The symbol on the \"pound\" key (#) is called an octothorpe..  "}, {"id": "8411fddb7e2954c9cbaf6b405120fa83", "text": "In eighteenth-century English gambling dens, there was an employee whose only job was to swallow the dice if there was a police raid."}, {"id": "aae20a02ea287829a83e9137d568d8aa", "text": "Nutmeg is extremely poisonous if injected intravenously."}, {"id": "0080c2ea301d2cc9dacf51423fe99af3", "text": "Hershey`s Kisses are called that because the machine that makes them looks like it`s kissing the conveyor belt."}, {"id": "11019ab41d0669f3848468060c5322b2", "text": "Dolphins sleep with one eye open!"}, {"id": "b8187d1d5676c6bab434de683bf2f170", "text": "The crack of a whip is actually a tiny sonic boom, since the tip breaks the sound barrier."}, {"id": "8004e556fa334958864c1589c43dbd8f", "text": "There`s a systematic lull in conversation every 7 minutes."}, {"id": "de1b010f76b39dec9a87dcdea133e1e1", "text": "Dr. Kellogg introduced Kellogg`s Corn Flakes in hopes that it would reduce masturbation."}, {"id": "9f83204cc20fd3f78ff32c77e78d317b", "text": "The first song played on Armed Forces Radio during operation Desert Shield was \"Rock the Casba\" by the Clash."}, {"id": "398d8b89bdc4b43c853fc7c4d8b3fcb8", "text": "A snail can sleep for three years."}, {"id": "5e5c47106b96e4ad2c987dcf7c213045", "text": "Odds of being killed by lightening? 1 in 2million/killed in a car crash? 1 in 5,000/killed by falling out of bed? 1 in 2million/killed in a plane crash? 1 in 25 million."}, {"id": "73f1534fae4cfae24309b3276b52c0c3", "text": "The average lifespan of an eyelash is five months."}, {"id": "c148658a39a4687f266294c9cb5bb4c0", "text": "Jefferson invented the dumbwaiter, the monetary system, and the folding attic ladder."}, {"id": "22549fa9491f7f6fd71bb682c11956cc", "text": "More Monopoly money is printed in a year, than real money throughout the world."}, {"id": "410b696f5ec29962f6feaa6e37c1e7f9", "text": "Most toilets flush in E flat."}, {"id": "038a73550cb199a070f45be7824c738e", "text": "In the Philippine jungle, the yo-yo was first used as a weapon."}, {"id": "ec36d7884a85ddbf09c49da9fd299660", "text": "Former basketball superstar Michael Jordan is the most recognized face in the world, more than the pope himself."}, {"id": "a1efb2e9ef6680e3ad49fda1fa7568d6", "text": "The praying mantis is the only insect that can turn its head"}, {"id": "9a322f0987f9ac2208a21c981bed8e4e", "text": "On average, Americans` favorite smell is banana."}, {"id": "1173c33c84146fcc7825c04683ce9496", "text": "One-fourth of the world`s population lives on less than $200 a year.  Ninety million people survive on less than $75 a year."}, {"id": "a07e632516c51f79b20bfb78e67c5d1a", "text": "The king of hearts is the only king without a mustache."}, {"id": "017e12a12972b700a050091e6e84130d", "text": "This common everyday occurrence composed of 59% nitrogen, 21% hydrogen, and 9% dioxide is called a `fart`."}, {"id": "31a74a666f22183339ec452d0e93c837", "text": "Pamela Anderson Lee is Canada`s Centennial Baby, being the first baby born on the centennial anniversary of Canada`s independence."}, {"id": "720508d6ad0e0b59f69b5fad0f78d596", "text": "The HyperMart outside of Garland Texas has 58 check-outs."}, {"id": "88fe87028c2afb60c90f4aff84a12d45", "text": "If done perfectly, a rubix cube combination can be solved in 17 turns."}, {"id": "c69b900d6bda899e28038ed9905b4165", "text": "The eyes of a donkey are positioned so that it can see all four feet at all times."}, {"id": "3b8c10e9cefa0eee8962ec37c9137459", "text": "The first contraceptive was crocodile dung used by the ancient Egyptians."}, {"id": "bcd75f5c0e08b30429a18500433ab1d6", "text": "If a rooster can`t fully extend its neck, it can`t crow."}, {"id": "b8583f70c337e9723399acbf6cb05b2f", "text": "William Marston engineered one of the earliest forms of the polygraph in the early 1900`s. Later he went on to create the comic strip Wonder Woman, a story about a displaced Amazon princess who forces anyone caught in her magic lasso to tell the truth"}, {"id": "f59ab7a208fbc7f407ca7ce31111c8c9", "text": "A crocodile cannot stick its tongue out."}, {"id": "25ad37b754b5f9833358fe08e810613e", "text": "If you go blind in one eye you only lose about one fifth of your vision but all your sense of depth."}, {"id": "47141b4470260e755c63aacd3ce70439", "text": "Thirty-five percent of people who use personal ads for dating are already married."}, {"id": "9fe1476f8831fee1a2448ded9d07c3fb", "text": "The pupils of a goat`s eyes are square."}, {"id": "56ffd45c1bd9faf72c148736a883a360", "text": "Months that begin on a Sunday will always have a `Friday the 13th`."}, {"id": "a0e7136a6995af3ccb1157f9dd7c5cb5", "text": "In 1778, fashionable women of Paris never went out in blustery weather without a lightning rod attached to their hats."}, {"id": "7402a6038f379f7ff5f9e38c895841d7", "text": "Most lipstick contains fish scales!"}, {"id": "6d9f0396027a46966036c5db605569e1", "text": "The average talker sprays about 300 microscopic saliva droplets per minute, about 2.5 droplets per word."}, {"id": "8198a291cc48ce10c45937ba9b35a395", "text": "To Ensure Promptness, one is expected to pay beyond the value of service – hence the later abbreviation: T.I.P."}, {"id": "1d0f2997d47a16e2fac88c42c0f0dee1", "text": "In Aspen Colorado, you can have a maximum income of $104,000 and still receive government subsidized housing."}, {"id": "6488d862801b5008cd6377eaf96431bb", "text": "\"Underground\" is the only word in the English language that begins and ends with the letters \"und\""}, {"id": "947307a045b9e16a40abfad1db7e37f7", "text": "To escape the grip of a crocodile`s jaws, push your thumbs into its eyeballs - it will let you go instantly."}, {"id": "e7927680a66cf2bd83dafde7bfdc3248", "text": "Between 2 and 3 jockeys are killed each year in horse racing."}, {"id": "9dc6007de790ced736256364a22c0ec2", "text": "Los Angeles` full name `El Pueblo de Nuestra Senora la Reina de Los Angeles de Porciuncula` is reduced to 3.63% of its size in the abbreviation `L.A.`."}, {"id": "76ea49bfded6fd56c9b2b154519e0368", "text": "The highest per capita Jell-O comsumption in the US is Des Moines."}, {"id": "66c9546d229838f57824ad4b3c534220", "text": "Simplistic passwords contribute to over 80% of all computer password break-ins."}, {"id": "29fa57b8e8711069691de8625b28519b", "text": "1 in every 4 Americans has appeared someway or another on television."}, {"id": "80b79a49182ff57675721e18d31f1763", "text": "The buzz from an electric razor in America plays in the key of B flat; Key of G in England."}, {"id": "fed26ab4f88901568ba31978191ada33", "text": "The Great Wall of China is the only man-made structure visible from space."}, {"id": "cdafdee552b6299356c37a296f9c9eb3", "text": "There are 336 dimples on a regulation golf ball."}, {"id": "b939f633344b66cb732bdc078db9dd4d", "text": "Until 1994, world maps and globes sold in Albania only had Albania on them."}, {"id": "78e7f1adff152ae7ad66821de0ca076b", "text": "Golf courses cover 4% of North America."}, {"id": "ba66e4c4f268a6b03f15ad561b067294", "text": "\"Dreamt\" is the only English word that ends in the letters \"mt.\""}, {"id": "3a061e7a74a910de2a85fc3faaceca42", "text": "You can be fined up to $1,000 for whistling on Sunday in Salt Lake City, Utah."}, {"id": "c67ee2b7913742a96247227dc9ac58b2", "text": "In England, the Speaker of the House is not allowed to speak."}, {"id": "81061a01d37c6762c576e3ab68e8d055", "text": "The Boston University Bridge (on Commonwealth Avenue, Boston, Massachusetts) is the only place in the world where a boat can sail under a train driving under a car driving under an airplane."}, {"id": "dbaca7b9d02eae41dcebf7cd518fc2f5", "text": "China has more English speakers than the United States."}, {"id": "2d3e21d5f5f8f02a0cc43c82944311ef", "text": "In most advertisements, including newspapers, the time displayed on a watch is 10:10."}, {"id": "0a3172ba7bcfb57e8588f933e028f93d", "text": "The scene where Indiana Jones shoots the swordsman in Raider’s of the Lost Ark was Harrison Ford's idea so that he could take a bathroom break."}, {"id": "a4bd66605d8268469ae8bd0e57903648", "text": "The only nation whose name begins with an \"A\", but doesn`t end in an \"A\" is Afghanistan."}, {"id": "755166c36e206fd68b83936884c61cf1", "text": "If Texas were a country, its GNP would be the fifth largest of any country in the world."}, {"id": "15667e8c10b28cac7ab8fc91aedd6448", "text": " was Harrison Ford`s idea so that he could take a bathroom break."}, {"id": "335d938ce8c16d88d6e5189c9b533666", "text": "A `jiffy` is a unit of time for 1/100th of a second."}, {"id": "9d1b9e9224fe532cc9ff729cd27aba6d", "text": "111,111,111 x 111,111,111 = 12,345,678,987,654,321"}, {"id": "8c0a54e73a103678af4464944d0a6e10", "text": "38% of American men say they love their cars more than women"}, {"id": "6f1efaa84020a9f7da0e0443c4d7fb8a", "text": "A giraffe can go without water longer than a camel."}, {"id": "2df62299cafe6d8e84cc9bd27981a20e", "text": "Spain leads the world in cork production"}, {"id": "69b77879a0187cf159db700b74000e67", "text": "The shortest war in history was between Zanzibar and England in 1896. Zanzibar surrendered after 38 minutes."}, {"id": "4fdd6232c09335e6d0f556ac1d76dd70", "text": "Shakespeare spelled his OWN name several different ways."}, {"id": "97765a61f9b3173ffe7b576ae9b8c784", "text": "the bird is the word"}, {"id": "c01bf758ee8d660eb67700619a057a5c", "text": "Every acre of American crops harvested contains 100 pounds of insects."}, {"id": "ca469dcf47c12df279a88b5515b4bf20", "text": "Mr. Rogers is an ordained minister."}, {"id": "45caa139567e4944550d9eadf41b5caa", "text": "A goldfish has a memory span of three seconds.  "}, {"id": "54540d7fadd6c53ca4f77d645b3dd752", "text": "Butterflies taste with their hind feet."}, {"id": "a313d6861427c089d43b14ea32472e1f", "text": "Donald Duck comics were banned from Finland because he doesn`t wear pants!"}, {"id": "2889d8e54be016bfa5961c7cc0dad6c0", "text": "The amount of computer Memory required to run WordPerfect for Win95 is 8 times the amount needed aboard the space shuttle."}, {"id": "94e134afb46c3b640d60c33369258990", "text": "A jellyfish is 95 percent water!"}, {"id": "76e238c6114ac90c082f3b2f9d7b304d", "text": "Walt Disney was afraid of mice."}, {"id": "12e54e979451393be3973cd9481d6fd6", "text": "THE MOST UNUSUAL CANNONBALL: On two occasions, Miss `Rita Thunderbird` remained inside the cannon despite a lot of gunpowder encouragement to do otherwise. She performed in a gold lamé bikini and on one of the two occasions (1977) Miss Thunderbird remained lodged in the cannon, while her bra was shot across the Thames River."}, {"id": "cd61dcd86e7a3ee47b7877eadacce811", "text": "The first CD pressed in the US was Bruce Springsteen`s `Born in the USA`"}, {"id": "6f517dd4dfab50029f4fb2db74943b5c", "text": "There are 269 steps to the top of the Leaning Tower of Pisa"}, {"id": "daf2c54fc64779e07467ea7453400849", "text": "No word in the English language rhymes with month, orange, silver and purple."}, {"id": "a451b3bb38d813b16a5e8b8ad4c83b84", "text": "Every time you lick a stamp, you consume 1/10 of a calorie."}, {"id": "99fff29ba89bb27f2f67be85d4bf4651", "text": "Eating the heart of a male Partridge was the cure for impotence in ancient Babylon."}, {"id": "a33fba0c1d1dc15d6d1aebb8e167957a", "text": "Average life span of a major league baseball: 7 pitches."}, {"id": "6064df56adfae9cdca9cc428312343be", "text": "In medieval France, unfaithful wives were made to chase a chicken through town naked."}, {"id": "de5646e738eb8af844fa241dc42cd281", "text": "The average American/Canadian will eat about 11.9 pounds of cereal per year!"}, {"id": "894b792f49f4fc50dd0994d72ab88b83", "text": "Two-thirds of the world`s eggplant is grown in New Jersey.  "}, {"id": "501eb21934c84fa55b4cea047940bed1", "text": "Half the foods eaten throughout the world today were developed by farmers in the Andes Mountains (including potatoes, maize, sweet potatoes, squash, all varieties of beans, peanuts, manioc, papayas, strawberries, mulberries and many others)."}, {"id": "906c63c2599eb88a42ddec75fd48e5d9", "text": "It takes about 142.18 licks to reach the center of a Tootsie pop."}, {"id": "6008fc96c6043c62735183ae5fcf77d4", "text": "Ingrown toenails are hereditary.  "}, {"id": "cd7a1bcac750a45f7b0dda09ec1e039a", "text": "Length of beard an average man would grow if he never shaved 27.5 feet"}, {"id": "d8bb5d4d9603f350ee25c074366abbb4", "text": "There is approximately one chicken for every human being in the world."}, {"id": "2fa3f5e4edcbeb2c4b1eba1e7718ba4b", "text": "Each of us generates about 3.5 pounds of rubbish a day, most of it paper."}, {"id": "1d4e170d428144f5e8a4d2af83e0d9c7", "text": "In the United States, a pound of potato chips costs two hundred times more than a pound of potatoes."}, {"id": "8b381465316830b8f9655efea3346ce4", "text": "One of the reasons marijuana is illegal today is because cotton growers in the 1930s lobbied against hemp farmers they saw it as competition."}, {"id": "aa973c0e0e06fd41ec814afd33252c81", "text": "Giraffes have no vocal cords."}, {"id": "134854ab8504d3d5bafa7a0f0686c8cb", "text": "There are more plastic flamingos in the U.S that there are real ones."}, {"id": "bc185f4257b4996266eaa3e18c490ae4", "text": "Oak trees do not produce acorns until they are fifty years of age or older."}, {"id": "3dbc34395076951bee62e948aec687eb", "text": "Napoleon`s penis was sold to an American Urologist for $40,000."}, {"id": "954046b3b18dc5c386b83137f565cb58", "text": "3.6 cans of Spam are consumed each second."}, {"id": "700200e99c39d94db10b340acc3ed9cd", "text": "The word \"samba\" means \"to rub navels together.\""}, {"id": "3b3dd7608388f9341fe1d2878a5c7f5b", "text": "Virginia Woolf wrote all her books standing."}, {"id": "9bdc30bb257d1e50ec2fb504357cf66a", "text": "Facetious and abstemious contain all the vowels in the correct order, as does arsenious, meaning \"containing arsenic.\"  "}, {"id": "2781366ffa6279ac04831226ad536abf", "text": "Donald Duck`s middle name is Fauntleroy.  "}, {"id": "4b8b307620b1ce0ce632dd976b4e0387", "text": "In the last 3,500 years, there have been approximately 230 years of peace throughout the civilized world."}, {"id": "afb4e4bf796ca4524d6a7384e0c61311", "text": "The `Golden Arches` of fast food chain McDonalds is more recognized worldwide than the religious cross of Christianity."}, {"id": "d970122d4cc9d6ae7472ef34a8760fc2", "text": "The state of Florida is bigger than England!"}, {"id": "9a7648a7ab73922728a2e68825b71a3a", "text": "It takes 3,000 cows to supply the NFL with enough leather for a year`s supply of footballs."}, {"id": "0dc8463c6a77846dc738be056ffa9c9b", "text": "Jupiter is bigger than all the other planets in our solar system combined."}, {"id": "b1af0061fb234ef68a9b82de46f63a7e", "text": "A rainbow can be seen only in the morning or late afternoon. It can occur only when the sun is 40 degrees or less above the horizon."}, {"id": "84f3364fc5e98a90487a0d9f81e8d19e", "text": "The citrus soda 7-UP was created in 1929; `7` was selected after the original 7-ounce containers and `UP` for the direction of the bubbles."}, {"id": "2813aeccdbd109e94a5ceb826a504daf", "text": "When a Hawaiian woman wears a flower over her left ear, it means that she is not available."}, {"id": "28c716c301c959e26f66fc3a347edd45", "text": "There are 293 ways to make change for a dollar."}, {"id": "98eab9d565ba7750139217cf985a79ed", "text": "Women blink nearly twice as much as men."}, {"id": "e17dbc8227aeef69e0144649714738ea", "text": "101 Dalmatians, Peter Pan, Lady and the Tramp, and Mulan are the only Disney cartoons where both parents are present and don`t die throughout the movie."}, {"id": "82c3dc84e2f2025a9138752db5004ece", "text": "The Pentagon, in Arlington, Virginia, has twice as many bathrooms as is necessary, because when it was built in the 1940s, the state of Virginia still had segregation laws requiring separate toilet facilities for blacks and whites."}, {"id": "4de21b0731f215a6277c4d559ff7fd90", "text": "In the marriage ceremony of the ancient Inca Indians of Peru, the couple was considered officially wed when they took off their sandals and handed them to each other."}, {"id": "58ce5dab7f78d74d7caecc21e4cdcbf6", "text": "It is illegal to hunt camels in the state of Arizona."}, {"id": "ee59ae25da83bd38dc1494cf221bc798", "text": "In Vermont, the ratio of cows to people is 10:1"}, {"id": "a02866dcba360c387efe2e2da1c7e755", "text": "A standard slinky measures 87 feet when stretched out."}, {"id": "0f130866f3c312ca1834fb7ab6388c2c", "text": "When the French Academy was preparing its first dictionary, it defined \"crab\" as, \"A small red fish, which walks backwards.\" This definition was sent with a number of others to the naturalist Cuvier for his approval. The scientist wrote back, \"Your definition, gentlemen, would be perfect, only for three exceptions. The crab is not a fish, it is not red and it does not walk backwards.\""}, {"id": "ef876a42f8ccf5329e1bdca3f210095e", "text": "Iceland consumes more Coca-Cola per capita than any other nation."}, {"id": "cb3fff99a090ef71e5b74fdfad6dc8be", "text": "The thumbnail grows the slowest, the middle nail the fastest, nearly 4 times faster than toenails."}, {"id": "4e3dc922ed83f4c6eead46418094740d", "text": "The longest place-name still in use is: Taumatawhakatangihangakoauauotamateaturipukakapikimaungahoronukupokaiakitnatahu, a New Zealand hill.  "}, {"id": "72be8a70dba147b1f1bf6d8840d43f88", "text": "1 in 8 Americans has worked at a McDonalds restaurant."}, {"id": "0bbb9d7cca247a69d518e038370cf639", "text": "Annual growth of WWW traffic is 314,000%"}, {"id": "f21f3b1d3923002b864c516762575d6b", "text": "Because of the rotation of the earth, an object can be thrown farther if it is thrown west."}, {"id": "7b53248635408f112cd728e3981056d8", "text": "On average, Americans eat 18 acres of pizza everyday."}, {"id": "3351933a6b657cd7e8d58124a2cec0a7", "text": "The human heart creates enough pressure to squirt blood 30ft."}, {"id": "29c04092542e313890d1ea0195aba86d", "text": "The longest recorded flight of a chicken is thirteen seconds."}, {"id": "31e3847c195e85fdb32adef429fd30d8", "text": "The muzzle of a lion is like a fingerprint - no two lions have the same pattern of whiskers.  "}, {"id": "4818436c0ed00a79dd8ae899aac78717", "text": "Only female mosquito’s` bite and most are attracted to the color blue twice as much as to any other color."}, {"id": "c0ba7eafa2803ca817919d14017ba424", "text": "In 1980, a Las Vegas hospital suspended workers for betting on when patients would die."}, {"id": "bab30e8879f6c47780007d4680c9b5b3", "text": "Maine is the only state whose name is just one syllable."}, {"id": "f752747ec40125d2cd322ac18cf771ba", "text": "The longest word in the English language, according to the Oxford English Dictionary, is: pneumonoultramicroscopicsilicovolcanoconiosis..  "}, {"id": "13ce4f95fce6e6f0220c803c24cd2dfd", "text": "The \"save\" icon on Microsoft Word shows a floppy disk with the shutter on backwards."}, {"id": "a104fd2271d2a5c93d11d8eaa613c6af", "text": "Average number of people airborne over the US any given hour: 61,000."}, {"id": "8e039f6df2fef8b2f4cef6ecb23c4c02", "text": "An ostrich`s eye is bigger than its brain.  "}, {"id": "aca91f861880daaa4d91f4dfd66a3d4f", "text": "The Vatican city registered 0 births in 1983"}, {"id": "66f87f99e8c27e1c15c9ecba5528fcea", "text": "Pearls melt in vinegar."}, {"id": "bb2aec8ed6dce43bac1673e6ba55993b", "text": "All polar bears are left-handed."}, {"id": "cfea5f369c38686a6c99e2374c133cf7", "text": "The letters KGB stand for Komitet Gosudarstvennoy Bezopasnosti.  "}, {"id": "ba556dcd03dab36848dbf19fc03824c4", "text": "Nearly 80% of all animals on earth have six legs."}, {"id": "78824c7bc4daa0a24607fbeeb24f26e8", "text": "The S in Harry S. Truman did not stand for anything."}, {"id": "91276255ba07e327846576a723f9046a", "text": "Van Gogh only sold one painting when he was alive."}, {"id": "95b759d047e3bf8c88e08eaaf40880c1", "text": "The only 15-letter word that can be spelled without repeating a letter is uncopyrightable."}, {"id": "75df2694b257046316c4579a2d2a7e2e", "text": "The Eisenhower interstate system requires that one mile in every five must be straight in case of war or emergency, they could be used as airstrips."}, {"id": "d776472f105376e395246318c6fa8fbb", "text": "If we had the same mortality rate now as in 1900, more than half the people in the world today would not be alive."}]